Python 3.11.3 (tags/v3.11.3:f3909b8, Apr  4 2023, 23:49:59) [MSC v.1934 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

===== RESTART: C:/c언어/오픈소스 프로그래밍/SELF STUDY 9-2.py ====
첫 번째 수를 입력하세요: 34
계산을 입력하세요(+, -, * , /, **): /
두 번째 수를 입력하세요: 0
0으로는 나누면 안됩니다.ㅠㅠ
계산불가
계속하려면 Y를 눌러주세요: ㅛ
프로그램을 종료합니다.

=== RESTART: C:/c언어/오픈소스 프로그래밍/SELF-STUDY 9-2(2).py ===
첫 번째 수를 입력하세요 : 34
계산을 입력하세요( +, -, * , / , ** ) : /
두 번째 수를 입력하세요 : 0
0으로는 나누면 안됩니다. ㅠㅠ

=== RESTART: C:/c언어/오픈소스 프로그래밍/SELF-STUDY 9-2(2).py ===
첫 번째 수를 입력하세요 : 34
계산을 입력하세요( +, -, * , / , ** ) : /
두 번째 수를 입력하세요 : 0
0으로는 나누면 안됩니다. ㅠㅠ
계산불가

=== RESTART: C:/c언어/오픈소스 프로그래밍/SELF-STUDY 9-2(2).py ===
첫 번째 수를 입력하세요 : 34
계산을 입력하세요( +, -, * , / , ** ) : /
두 번째 수를 입력하세요 : 2
## 계산기 : 34 / 2 = 17

===== RESTART: C:/c언어/오픈소스 프로그래밍/SELF STUDY 9-2.py ====
첫 번째 수를 입력하세요: 34
계산을 입력하세요(+, -, * , /, **): *
두 번째 수를 입력하세요: 5
##계산기 : 34 * 5 = 170
계속하려면 Y를 눌러주세요: ㅛ
프로그램을 종료합니다.

===== RESTART: C:/c언어/오픈소스 프로그래밍/SELF STUDY 9-2.py ====
첫 번째 수를 입력하세요: 34
계산을 입력하세요(+, -, * , /, **): +
두 번째 수를 입력하세요: 5
##계산기 : 34 + 5 = 39
계속하려면 Y를 눌러주세요: y
첫 번째 수를 입력하세요: 33
계산을 입력하세요(+, -, * , /, **): /
두 번째 수를 입력하세요: 0
0으로는 나누면 안됩니다.ㅠㅠ
계산불가
계속하려면 Y를 눌러주세요: Y
첫 번째 수를 입력하세요: 23
계산을 입력하세요(+, -, * , /, **): **
두 번째 수를 입력하세요: 3
##계산기 : 23 ** 3 = 12167
계속하려면 Y를 눌러주세요: 
프로그램을 종료합니다.

======= RESTART: C:/c언어/오픈소스 프로그래밍/Code09-07.py =======
func1()에서 a값 10
func2()에서 a값 10

====== RESTART: C:/c언어/오픈소스 프로그래밍/Code09-0-7-2.py =====
메인 시작에서 a값 20
func1()에서 a값 Hi
func2()에서 a값 Hi

====== RESTART: C:/c언어/오픈소스 프로그래밍/Code09-0-7-2.py =====
메인 시작에서 a값 20
func1()에서 a값 Hi
func2()에서 a값 Hi
메인 끝에서 a값 Hi

======= RESTART: C:/c언어/오픈소스 프로그래밍/Code09-09.py =======
multi()에서 돌려준 값 ==> 300, -100

======= RESTART: C:/c언어/오픈소스 프로그래밍/Code09-11.py =======
매개변수가 2개인 함수를 호출한 결과 ==> 30
매개변수가 3개인 함수를 호출한 결과 ==> 60

====== RESTART: C:/c언어/오픈소스 프로그래밍/Code09-12-2.py ======
매개변수가 2개인 함수를 호출한 결과 ==> 30
매개변수가 10개인 함수를 호출한 결과 ==> 550
>>> 
===== RESTART: C:/c언어/오픈소스 프로그래밍/딕셔너리 매개변수 걸그룹.py =====
트와이스 --> 9명입니다. 
소녀시대 --> 7명입니다. 
걸스데이 --> 4명입니다. 
블랙핑크 --> 4명입니다. 
>>> 
======= RESTART: C:/c언어/오픈소스 프로그래밍/Code09-13.py =======
** 로또 추첨을 시작합니다. **

추첨된 로또 번호 ==> 3626304142
>>> 
======= RESTART: C:/c언어/오픈소스 프로그래밍/Code09-13.py =======
** 로또 추첨을 시작합니다. **

추첨된 로또 번호 ==>  3812141628
>>> 
======= RESTART: C:/c언어/오픈소스 프로그래밍/Code09-13.py =======
** 로또 추첨을 시작합니다. **

추첨된 로또 번호 ==> 4 5 9 18 35 37 
